import { PrismaClient } from "@prisma/client"

const prisma = new PrismaClient()

const main = async () => {
	const offices = [
		{ name: "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 1 (บางขุนเทียน)", address: "เขตบางขุนเทียน กรุงเทพฯ" },
		{ name: "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 2 (ตลิ่งชัน)", address: "เขตตลิ่งชัน กรุงเทพฯ" },
		{ name: "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 3 (พระโขนง)", address: "เขตพระโขนง กรุงเทพฯ" },
		{ name: "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 4 (มีนบุรี)", address: "เขตมีนบุรี กรุงเทพฯ" },
		{ name: "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 5 (จตุจักร)", address: "เขตจตุจักร กรุงเทพฯ" },
		{ name: "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 6 (บางนา)", address: "เขตบางนา กรุงเทพฯ" },
		{ name: "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 7 (หลักสี่)", address: "เขตหลักสี่ กรุงเทพฯ" },
		{ name: "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 8 (หนองแขม)", address: "เขตหนองแขม กรุงเทพฯ" },
		{ name: "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 9 (บางเขน)", address: "เขตบางเขน กรุงเทพฯ" },
		{ name: "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 10 (บางแค)", address: "เขตบางแค กรุงเทพฯ" },
		{ name: "สำนักงานขนส่งจังหวัดนนทบุรี", address: "อำเภอเมือง นนทบุรี" },
		{ name: "สำนักงานขนส่งจังหวัดนนทบุรี สาขาบางบัวทอง", address: "บางบัวทอง นนทบุรี" },
		{ name: "สำนักงานขนส่งจังหวัดปทุมธานี", address: "อำเภอเมือง ปทุมธานี" },
		{ name: "สำนักงานขนส่งจังหวัดปทุมธานี สาขาธัญบุรี", address: "ธัญบุรี ปทุมธานี" },
		{ name: "สำนักงานขนส่งจังหวัดสมุทรปราการ", address: "อำเภอเมือง สมุทรปราการ" },
		{ name: "สำนักงานขนส่งจังหวัดสมุทรปราการ สาขาบางพลี", address: "บางพลี สมุทรปราการ" },
		{ name: "สำนักงานขนส่งจังหวัดสมุทรสาคร", address: "อำเภอเมือง สมุทรสาคร" },
		{ name: "สำนักงานขนส่งจังหวัดนครปฐม", address: "อำเภอเมือง นครปฐม" },
		{ name: "สำนักงานขนส่งจังหวัดนครปฐม สาขาบางเลน", address: "บางเลน นครปฐม" },
		{ name: "สำนักงานขนส่งจังหวัดพระนครศรีอยุธยา", address: "อำเภอพระนครศรีอยุธยา พระนครศรีอยุธยา" },
	]

	for (const office of offices) {
		await prisma.office.upsert({
			where: { name: office.name },
			update: {},
			create: office,
		})
	}
}

main()
	.then(async () => {
		console.log("✅ Seeding complete.")
		await prisma.$disconnect()
	})
	.catch(async (e) => {
		console.error(e)
		await prisma.$disconnect()
		process.exit(1)
	})
